#while ლუპი:while ლუპი მუშაობს მხოლოდ იმ პირობით,
#რომ სანამ მოცემული პირობა მართალია, ლუპი გააგრძელებს შესრულებას.
#თუ პირობა ხდება მცდარი (False), ლუპი შეწყდება.
#გამოიყენება მაშინ, როცა არ იცით წინასწარ რამდენჯერ უნდა შესრულდეს ციკლი.
#პირობა მუდმივად უნდა გამუდმებით შემოწმდეს, რათა ციკლმა იცოდეს, როდის შეჩერდეს.

 #for ლუპი:for ლუპი მუშაობს წინასწარ განსაზღვრულ დიაპაზონზე.
 #ვიცით, რომ ციკლი უნდა შესრულდეს გარკვეული რაოდენობისთვის ან 
#კონკრეტულ ელემენტებზე.
#გამოიყენება, როდესაც ვიცით კონკრეტულად რამდენჯერ უნდა შესრულდეს ციკლი,
#ან როცა ელემენტებზე უნდა გავიაროთ (მაგალითად, სიაში ან რიცხვების დიაპაზონში).

#განსხვავება
#while: როდესაც არ იცით რამდენჯერ უნდა გაიმეოროთ პროცესი, მაგრამ იცით, რომ პროცესი უნდა შეჩერდეს გარკვეული პირობით.
#for: როდესაც იცით კონკრეტული რაოდენობა ან ელემენტები, რომელზეც უნდა გავიაროთ.


